---
title: Color
classe: Autodesk.Revit.DB.Color
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# Color

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Byte Blue { get; set; }` | `color.Blue` | Byte |
| `Byte Green { get; set; }` | `color.Green` | Byte |
| `Color InvalidColorValue { get; }` | `Color.InvalidColorValue` | Color |
| `Boolean IsValid { get; }` | `color.IsValid` | Boolean |
| `Byte Red { get; set; }` | `color.Red` | Byte |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```